chrydelezuch/3DPrinter/Tests/build/test/mocks/test_stepper_motor/mock_stm32f4xx_hal_gpio.c
/* AUTOGENERATED FILE. DO NOT EDIT. */
#include <string.h>
#include <stdlib.h>
#include <setjmp.h>
#include "cmock.h"
#include "stm32f4xx_hal.h"
#include "mock_stm32f4xx_hal_gpio.h"
#include "cmock.h"

static const char* CMockString_GPIO_Init = "GPIO_Init";
static const char* CMockString_GPIO_Pin = "GPIO_Pin";
static const char* CMockString_GPIOx = "GPIOx";
static const char* CMockString_HAL_GPIO_DeInit = "HAL_GPIO_DeInit";
static const char* CMockString_HAL_GPIO_EXTI_IRQHandler = "HAL_GPIO_EXTI_IRQHandler";
static const char* CMockString_HAL_GPIO_Init = "HAL_GPIO_Init";
static const char* CMockString_HAL_GPIO_LockPin = "HAL_GPIO_LockPin";
static const char* CMockString_HAL_GPIO_ReadPin = "HAL_GPIO_ReadPin";
static const char* CMockString_HAL_GPIO_TogglePin = "HAL_GPIO_TogglePin";
static const char* CMockString_HAL_GPIO_WritePin = "HAL_GPIO_WritePin";
static const char* CMockString_PinState = "PinState";

typedef struct _CMOCK_HAL_GPIO_Init_CALL_INSTANCE
{
  UNITY_LINE_TYPE LineNumber;
  char ExpectAnyArgsBool;
  int CallOrder;
  GPIO_TypeDef* Expected_GPIOx;
  GPIO_InitTypeDef* Expected_GPIO_Init;
  CEXCEPTION_T ExceptionToThrow;
  char ReturnThruPtr_GPIOx_Used;
  GPIO_TypeDef const* ReturnThruPtr_GPIOx_Val;
  size_t ReturnThruPtr_GPIOx_Size;
  char ReturnThruPtr_GPIO_Init_Used;
  GPIO_InitTypeDef const* ReturnThruPtr_GPIO_Init_Val;
  size_t ReturnThruPtr_GPIO_Init_Size;
  char IgnoreArg_GPIOx;
  char IgnoreArg_GPIO_Init;

} CMOCK_HAL_GPIO_Init_CALL_INSTANCE;

typedef struct _CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE
{
  UNITY_LINE_TYPE LineNumber;
  char ExpectAnyArgsBool;
  int CallOrder;
  GPIO_TypeDef* Expected_GPIOx;
  uint32_t Expected_GPIO_Pin;
  CEXCEPTION_T ExceptionToThrow;
  char ReturnThruPtr_GPIOx_Used;
  GPIO_TypeDef const* ReturnThruPtr_GPIOx_Val;
  size_t ReturnThruPtr_GPIOx_Size;
  char IgnoreArg_GPIOx;
  char IgnoreArg_GPIO_Pin;

} CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE;

typedef struct _CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE
{
  UNITY_LINE_TYPE LineNumber;
  char ExpectAnyArgsBool;
  GPIO_PinState ReturnVal;
  int CallOrder;
  GPIO_TypeDef* Expected_GPIOx;
  uint16_t Expected_GPIO_Pin;
  CEXCEPTION_T ExceptionToThrow;
  char ReturnThruPtr_GPIOx_Used;
  GPIO_TypeDef const* ReturnThruPtr_GPIOx_Val;
  size_t ReturnThruPtr_GPIOx_Size;
  char IgnoreArg_GPIOx;
  char IgnoreArg_GPIO_Pin;

} CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE;

typedef struct _CMOCK_HAL_GPIO_WritePin_CALL_INSTANCE
{
  UNITY_LINE_TYPE LineNumber;
  char ExpectAnyArgsBool;
  int CallOrder;
  GPIO_TypeDef* Expected_GPIOx;
  uint16_t Expected_GPIO_Pin;
  GPIO_PinState Expected_PinState;
  CEXCEPTION_T ExceptionToThrow;
  char ReturnThruPtr_GPIOx_Used;
  GPIO_TypeDef const* ReturnThruPtr_GPIOx_Val;
  size_t ReturnThruPtr_GPIOx_Size;
  char IgnoreArg_GPIOx;
  char IgnoreArg_GPIO_Pin;
  char IgnoreArg_PinState;

} CMOCK_HAL_GPIO_WritePin_CALL_INSTANCE;

typedef struct _CMOCK_HAL_GPIO_TogglePin_CALL_INSTANCE
{
  UNITY_LINE_TYPE LineNumber;
  char ExpectAnyArgsBool;
  int CallOrder;
  GPIO_TypeDef* Expected_GPIOx;
  uint16_t Expected_GPIO_Pin;
  CEXCEPTION_T ExceptionToThrow;
  char ReturnThruPtr_GPIOx_Used;
  GPIO_TypeDef const* ReturnThruPtr_GPIOx_Val;
  size_t ReturnThruPtr_GPIOx_Size;
  char IgnoreArg_GPIOx;
  char IgnoreArg_GPIO_Pin;

} CMOCK_HAL_GPIO_TogglePin_CALL_INSTANCE;

typedef struct _CMOCK_HAL_GPIO_LockPin_CALL_INSTANCE
{
  UNITY_LINE_TYPE LineNumber;
  char ExpectAnyArgsBool;
  HAL_StatusTypeDef ReturnVal;
  int CallOrder;
  GPIO_TypeDef* Expected_GPIOx;
  uint16_t Expected_GPIO_Pin;
  CEXCEPTION_T ExceptionToThrow;
  char ReturnThruPtr_GPIOx_Used;
  GPIO_TypeDef const* ReturnThruPtr_GPIOx_Val;
  size_t ReturnThruPtr_GPIOx_Size;
  char IgnoreArg_GPIOx;
  char IgnoreArg_GPIO_Pin;

} CMOCK_HAL_GPIO_LockPin_CALL_INSTANCE;

typedef struct _CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE
{
  UNITY_LINE_TYPE LineNumber;
  char ExpectAnyArgsBool;
  int CallOrder;
  uint16_t Expected_GPIO_Pin;
  CEXCEPTION_T ExceptionToThrow;
  char IgnoreArg_GPIO_Pin;

} CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE;

static struct mock_stm32f4xx_hal_gpioInstance
{
  char HAL_GPIO_Init_IgnoreBool;
  char HAL_GPIO_Init_CallbackBool;
  CMOCK_HAL_GPIO_Init_CALLBACK HAL_GPIO_Init_CallbackFunctionPointer;
  int HAL_GPIO_Init_CallbackCalls;
  CMOCK_MEM_INDEX_TYPE HAL_GPIO_Init_CallInstance;
  char HAL_GPIO_DeInit_IgnoreBool;
  char HAL_GPIO_DeInit_CallbackBool;
  CMOCK_HAL_GPIO_DeInit_CALLBACK HAL_GPIO_DeInit_CallbackFunctionPointer;
  int HAL_GPIO_DeInit_CallbackCalls;
  CMOCK_MEM_INDEX_TYPE HAL_GPIO_DeInit_CallInstance;
  char HAL_GPIO_ReadPin_IgnoreBool;
  GPIO_PinState HAL_GPIO_ReadPin_FinalReturn;
  char HAL_GPIO_ReadPin_CallbackBool;
  CMOCK_HAL_GPIO_ReadPin_CALLBACK HAL_GPIO_ReadPin_CallbackFunctionPointer;
  int HAL_GPIO_ReadPin_CallbackCalls;
  CMOCK_MEM_INDEX_TYPE HAL_GPIO_ReadPin_CallInstance;
  char HAL_GPIO_WritePin_IgnoreBool;
  char HAL_GPIO_WritePin_CallbackBool;
  CMOCK_HAL_GPIO_WritePin_CALLBACK HAL_GPIO_WritePin_CallbackFunctionPointer;
  int HAL_GPIO_WritePin_CallbackCalls;
  CMOCK_MEM_INDEX_TYPE HAL_GPIO_WritePin_CallInstance;
  char HAL_GPIO_TogglePin_IgnoreBool;
  char HAL_GPIO_TogglePin_CallbackBool;
  CMOCK_HAL_GPIO_TogglePin_CALLBACK HAL_GPIO_TogglePin_CallbackFunctionPointer;
  int HAL_GPIO_TogglePin_CallbackCalls;
  CMOCK_MEM_INDEX_TYPE HAL_GPIO_TogglePin_CallInstance;
  char HAL_GPIO_LockPin_IgnoreBool;
  HAL_StatusTypeDef HAL_GPIO_LockPin_FinalReturn;
  char HAL_GPIO_LockPin_CallbackBool;
  CMOCK_HAL_GPIO_LockPin_CALLBACK HAL_GPIO_LockPin_CallbackFunctionPointer;
  int HAL_GPIO_LockPin_CallbackCalls;
  CMOCK_MEM_INDEX_TYPE HAL_GPIO_LockPin_CallInstance;
  char HAL_GPIO_EXTI_IRQHandler_IgnoreBool;
  char HAL_GPIO_EXTI_IRQHandler_CallbackBool;
  CMOCK_HAL_GPIO_EXTI_IRQHandler_CALLBACK HAL_GPIO_EXTI_IRQHandler_CallbackFunctionPointer;
  int HAL_GPIO_EXTI_IRQHandler_CallbackCalls;
  CMOCK_MEM_INDEX_TYPE HAL_GPIO_EXTI_IRQHandler_CallInstance;
} Mock;

extern int GlobalExpectCount;
extern int GlobalVerifyOrder;

void mock_stm32f4xx_hal_gpio_Verify(void)
{
  UNITY_LINE_TYPE cmock_line = TEST_LINE_NUM;
  CMOCK_MEM_INDEX_TYPE call_instance;
  call_instance = Mock.HAL_GPIO_Init_CallInstance;
  if (Mock.HAL_GPIO_Init_IgnoreBool)
    call_instance = CMOCK_GUTS_NONE;
  if (CMOCK_GUTS_NONE != call_instance)
  {
    UNITY_SET_DETAIL(CMockString_HAL_GPIO_Init);
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledLess);
  }
  if (Mock.HAL_GPIO_Init_CallbackFunctionPointer != NULL)
  {
    call_instance = CMOCK_GUTS_NONE;
    (void)call_instance;
  }
  call_instance = Mock.HAL_GPIO_DeInit_CallInstance;
  if (Mock.HAL_GPIO_DeInit_IgnoreBool)
    call_instance = CMOCK_GUTS_NONE;
  if (CMOCK_GUTS_NONE != call_instance)
  {
    UNITY_SET_DETAIL(CMockString_HAL_GPIO_DeInit);
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledLess);
  }
  if (Mock.HAL_GPIO_DeInit_CallbackFunctionPointer != NULL)
  {
    call_instance = CMOCK_GUTS_NONE;
    (void)call_instance;
  }
  call_instance = Mock.HAL_GPIO_ReadPin_CallInstance;
  if (Mock.HAL_GPIO_ReadPin_IgnoreBool)
    call_instance = CMOCK_GUTS_NONE;
  if (CMOCK_GUTS_NONE != call_instance)
  {
    UNITY_SET_DETAIL(CMockString_HAL_GPIO_ReadPin);
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledLess);
  }
  if (Mock.HAL_GPIO_ReadPin_CallbackFunctionPointer != NULL)
  {
    call_instance = CMOCK_GUTS_NONE;
    (void)call_instance;
  }
  call_instance = Mock.HAL_GPIO_WritePin_CallInstance;
  if (Mock.HAL_GPIO_WritePin_IgnoreBool)
    call_instance = CMOCK_GUTS_NONE;
  if (CMOCK_GUTS_NONE != call_instance)
  {
    UNITY_SET_DETAIL(CMockString_HAL_GPIO_WritePin);
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledLess);
  }
  if (Mock.HAL_GPIO_WritePin_CallbackFunctionPointer != NULL)
  {
    call_instance = CMOCK_GUTS_NONE;
    (void)call_instance;
  }
  call_instance = Mock.HAL_GPIO_TogglePin_CallInstance;
  if (Mock.HAL_GPIO_TogglePin_IgnoreBool)
    call_instance = CMOCK_GUTS_NONE;
  if (CMOCK_GUTS_NONE != call_instance)
  {
    UNITY_SET_DETAIL(CMockString_HAL_GPIO_TogglePin);
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledLess);
  }
  if (Mock.HAL_GPIO_TogglePin_CallbackFunctionPointer != NULL)
  {
    call_instance = CMOCK_GUTS_NONE;
    (void)call_instance;
  }
  call_instance = Mock.HAL_GPIO_LockPin_CallInstance;
  if (Mock.HAL_GPIO_LockPin_IgnoreBool)
    call_instance = CMOCK_GUTS_NONE;
  if (CMOCK_GUTS_NONE != call_instance)
  {
    UNITY_SET_DETAIL(CMockString_HAL_GPIO_LockPin);
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledLess);
  }
  if (Mock.HAL_GPIO_LockPin_CallbackFunctionPointer != NULL)
  {
    call_instance = CMOCK_GUTS_NONE;
    (void)call_instance;
  }
  call_instance = Mock.HAL_GPIO_EXTI_IRQHandler_CallInstance;
  if (Mock.HAL_GPIO_EXTI_IRQHandler_IgnoreBool)
    call_instance = CMOCK_GUTS_NONE;
  if (CMOCK_GUTS_NONE != call_instance)
  {
    UNITY_SET_DETAIL(CMockString_HAL_GPIO_EXTI_IRQHandler);
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledLess);
  }
  if (Mock.HAL_GPIO_EXTI_IRQHandler_CallbackFunctionPointer != NULL)
  {
    call_instance = CMOCK_GUTS_NONE;
    (void)call_instance;
  }
}

void mock_stm32f4xx_hal_gpio_Init(void)
{
  mock_stm32f4xx_hal_gpio_Destroy();
}

void mock_stm32f4xx_hal_gpio_Destroy(void)
{
  CMock_Guts_MemFreeAll();
  memset(&Mock, 0, sizeof(Mock));
  GlobalExpectCount = 0;
  GlobalVerifyOrder = 0;
}

#if defined (__IAR_SYSTEMS_ICC__)
#pragma weak HAL_GPIO_Init
#else
void HAL_GPIO_Init(GPIO_TypeDef* GPIOx, GPIO_InitTypeDef* GPIO_Init) __weak;
#endif

