chrydelezuch/3DPrinter/Tests/build/test/mocks/test_stepper_motor/mock_stm32f4xx_hal_gpio.c
void HAL_GPIO_Init(GPIO_TypeDef* GPIOx, GPIO_InitTypeDef* GPIO_Init)
{
  UNITY_LINE_TYPE cmock_line = TEST_LINE_NUM;
  CMOCK_HAL_GPIO_Init_CALL_INSTANCE* cmock_call_instance;
  UNITY_SET_DETAIL(CMockString_HAL_GPIO_Init);
  cmock_call_instance = (CMOCK_HAL_GPIO_Init_CALL_INSTANCE*)CMock_Guts_GetAddressFor(Mock.HAL_GPIO_Init_CallInstance);
  Mock.HAL_GPIO_Init_CallInstance = CMock_Guts_MemNext(Mock.HAL_GPIO_Init_CallInstance);
  if (Mock.HAL_GPIO_Init_IgnoreBool)
  {
    UNITY_CLR_DETAILS();
    return;
  }
  if (!Mock.HAL_GPIO_Init_CallbackBool &&
      Mock.HAL_GPIO_Init_CallbackFunctionPointer != NULL)
  {
    Mock.HAL_GPIO_Init_CallbackFunctionPointer(GPIOx, GPIO_Init, Mock.HAL_GPIO_Init_CallbackCalls++);
    UNITY_CLR_DETAILS();
    return;
  }
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringCalledMore);
  cmock_line = cmock_call_instance->LineNumber;
  if (cmock_call_instance->CallOrder > ++GlobalVerifyOrder)
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledEarly);
  if (cmock_call_instance->CallOrder < GlobalVerifyOrder)
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledLate);
  if (!cmock_call_instance->ExpectAnyArgsBool)
  {
  if (!cmock_call_instance->IgnoreArg_GPIOx)
  {
    UNITY_SET_DETAILS(CMockString_HAL_GPIO_Init,CMockString_GPIOx);
    UNITY_TEST_ASSERT_EQUAL_MEMORY((void*)(cmock_call_instance->Expected_GPIOx), (void*)(GPIOx), sizeof(GPIO_TypeDef), cmock_line, CMockStringMismatch);
  }
  if (!cmock_call_instance->IgnoreArg_GPIO_Init)
  {
    UNITY_SET_DETAILS(CMockString_HAL_GPIO_Init,CMockString_GPIO_Init);
    UNITY_TEST_ASSERT_EQUAL_MEMORY((void*)(cmock_call_instance->Expected_GPIO_Init), (void*)(GPIO_Init), sizeof(GPIO_InitTypeDef), cmock_line, CMockStringMismatch);
  }
  }
  if (Mock.HAL_GPIO_Init_CallbackFunctionPointer != NULL)
  {
    Mock.HAL_GPIO_Init_CallbackFunctionPointer(GPIOx, GPIO_Init, Mock.HAL_GPIO_Init_CallbackCalls++);
  }
  if (cmock_call_instance->ExceptionToThrow != CEXCEPTION_NONE)
  {
    UNITY_CLR_DETAILS();
    Throw(cmock_call_instance->ExceptionToThrow);
  }
  if (cmock_call_instance->ReturnThruPtr_GPIOx_Used)
  {
    UNITY_TEST_ASSERT_NOT_NULL(GPIOx, cmock_line, CMockStringPtrIsNULL);
    memcpy((void*)GPIOx, (const void*)cmock_call_instance->ReturnThruPtr_GPIOx_Val,
      cmock_call_instance->ReturnThruPtr_GPIOx_Size);
  }
  if (cmock_call_instance->ReturnThruPtr_GPIO_Init_Used)
  {
    UNITY_TEST_ASSERT_NOT_NULL(GPIO_Init, cmock_line, CMockStringPtrIsNULL);
    memcpy((void*)GPIO_Init, (const void*)cmock_call_instance->ReturnThruPtr_GPIO_Init_Val,
      cmock_call_instance->ReturnThruPtr_GPIO_Init_Size);
  }
  UNITY_CLR_DETAILS();
}

void CMockExpectParameters_HAL_GPIO_Init(CMOCK_HAL_GPIO_Init_CALL_INSTANCE* cmock_call_instance, GPIO_TypeDef* GPIOx, GPIO_InitTypeDef* GPIO_Init);
void CMockExpectParameters_HAL_GPIO_Init(CMOCK_HAL_GPIO_Init_CALL_INSTANCE* cmock_call_instance, GPIO_TypeDef* GPIOx, GPIO_InitTypeDef* GPIO_Init)
{
  cmock_call_instance->Expected_GPIOx = GPIOx;
  cmock_call_instance->IgnoreArg_GPIOx = 0;
  cmock_call_instance->ReturnThruPtr_GPIOx_Used = 0;
  cmock_call_instance->Expected_GPIO_Init = GPIO_Init;
  cmock_call_instance->IgnoreArg_GPIO_Init = 0;
  cmock_call_instance->ReturnThruPtr_GPIO_Init_Used = 0;
}

void HAL_GPIO_Init_CMockIgnore(void)
{
  Mock.HAL_GPIO_Init_IgnoreBool = (char)1;
}

void HAL_GPIO_Init_CMockStopIgnore(void)
{
  Mock.HAL_GPIO_Init_IgnoreBool = (char)0;
}

void HAL_GPIO_Init_CMockExpectAnyArgs(UNITY_LINE_TYPE cmock_line)
{
  CMOCK_MEM_INDEX_TYPE cmock_guts_index = CMock_Guts_MemNew(sizeof(CMOCK_HAL_GPIO_Init_CALL_INSTANCE));
  CMOCK_HAL_GPIO_Init_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_Init_CALL_INSTANCE*)CMock_Guts_GetAddressFor(cmock_guts_index);
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringOutOfMemory);
  memset(cmock_call_instance, 0, sizeof(*cmock_call_instance));
  Mock.HAL_GPIO_Init_CallInstance = CMock_Guts_MemChain(Mock.HAL_GPIO_Init_CallInstance, cmock_guts_index);
  Mock.HAL_GPIO_Init_IgnoreBool = (char)0;
  cmock_call_instance->LineNumber = cmock_line;
  cmock_call_instance->CallOrder = ++GlobalExpectCount;
  cmock_call_instance->ExceptionToThrow = CEXCEPTION_NONE;
  cmock_call_instance->ExpectAnyArgsBool = (char)0;
  cmock_call_instance->ExpectAnyArgsBool = (char)1;
}

void HAL_GPIO_Init_CMockExpect(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, GPIO_InitTypeDef* GPIO_Init)
{
  CMOCK_MEM_INDEX_TYPE cmock_guts_index = CMock_Guts_MemNew(sizeof(CMOCK_HAL_GPIO_Init_CALL_INSTANCE));
  CMOCK_HAL_GPIO_Init_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_Init_CALL_INSTANCE*)CMock_Guts_GetAddressFor(cmock_guts_index);
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringOutOfMemory);
  memset(cmock_call_instance, 0, sizeof(*cmock_call_instance));
  Mock.HAL_GPIO_Init_CallInstance = CMock_Guts_MemChain(Mock.HAL_GPIO_Init_CallInstance, cmock_guts_index);
  Mock.HAL_GPIO_Init_IgnoreBool = (char)0;
  cmock_call_instance->LineNumber = cmock_line;
  cmock_call_instance->CallOrder = ++GlobalExpectCount;
  cmock_call_instance->ExceptionToThrow = CEXCEPTION_NONE;
  cmock_call_instance->ExpectAnyArgsBool = (char)0;
  CMockExpectParameters_HAL_GPIO_Init(cmock_call_instance, GPIOx, GPIO_Init);
}

void HAL_GPIO_Init_AddCallback(CMOCK_HAL_GPIO_Init_CALLBACK Callback)
{
  Mock.HAL_GPIO_Init_IgnoreBool = (char)0;
  Mock.HAL_GPIO_Init_CallbackBool = (char)1;
  Mock.HAL_GPIO_Init_CallbackFunctionPointer = Callback;
}

void HAL_GPIO_Init_Stub(CMOCK_HAL_GPIO_Init_CALLBACK Callback)
{
  Mock.HAL_GPIO_Init_IgnoreBool = (char)0;
  Mock.HAL_GPIO_Init_CallbackBool = (char)0;
  Mock.HAL_GPIO_Init_CallbackFunctionPointer = Callback;
}

void HAL_GPIO_Init_CMockExpectAndThrow(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, GPIO_InitTypeDef* GPIO_Init, CEXCEPTION_T cmock_to_throw)
{
  CMOCK_MEM_INDEX_TYPE cmock_guts_index = CMock_Guts_MemNew(sizeof(CMOCK_HAL_GPIO_Init_CALL_INSTANCE));
  CMOCK_HAL_GPIO_Init_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_Init_CALL_INSTANCE*)CMock_Guts_GetAddressFor(cmock_guts_index);
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringOutOfMemory);
  memset(cmock_call_instance, 0, sizeof(*cmock_call_instance));
  Mock.HAL_GPIO_Init_CallInstance = CMock_Guts_MemChain(Mock.HAL_GPIO_Init_CallInstance, cmock_guts_index);
  Mock.HAL_GPIO_Init_IgnoreBool = (char)0;
  cmock_call_instance->LineNumber = cmock_line;
  cmock_call_instance->CallOrder = ++GlobalExpectCount;
  cmock_call_instance->ExceptionToThrow = CEXCEPTION_NONE;
  cmock_call_instance->ExpectAnyArgsBool = (char)0;
  CMockExpectParameters_HAL_GPIO_Init(cmock_call_instance, GPIOx, GPIO_Init);
  cmock_call_instance->ExceptionToThrow = cmock_to_throw;
}

void HAL_GPIO_Init_CMockReturnMemThruPtr_GPIOx(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef const* GPIOx, size_t cmock_size)
{
  CMOCK_HAL_GPIO_Init_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_Init_CALL_INSTANCE*)CMock_Guts_GetAddressFor(CMock_Guts_MemEndOfChain(Mock.HAL_GPIO_Init_CallInstance));
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringPtrPreExp);
  cmock_call_instance->ReturnThruPtr_GPIOx_Used = 1;
  cmock_call_instance->ReturnThruPtr_GPIOx_Val = GPIOx;
  cmock_call_instance->ReturnThruPtr_GPIOx_Size = cmock_size;
}

void HAL_GPIO_Init_CMockReturnMemThruPtr_GPIO_Init(UNITY_LINE_TYPE cmock_line, GPIO_InitTypeDef const* GPIO_Init, size_t cmock_size)
{
  CMOCK_HAL_GPIO_Init_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_Init_CALL_INSTANCE*)CMock_Guts_GetAddressFor(CMock_Guts_MemEndOfChain(Mock.HAL_GPIO_Init_CallInstance));
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringPtrPreExp);
  cmock_call_instance->ReturnThruPtr_GPIO_Init_Used = 1;
  cmock_call_instance->ReturnThruPtr_GPIO_Init_Val = GPIO_Init;
  cmock_call_instance->ReturnThruPtr_GPIO_Init_Size = cmock_size;
}

void HAL_GPIO_Init_CMockIgnoreArg_GPIOx(UNITY_LINE_TYPE cmock_line)
{
  CMOCK_HAL_GPIO_Init_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_Init_CALL_INSTANCE*)CMock_Guts_GetAddressFor(CMock_Guts_MemEndOfChain(Mock.HAL_GPIO_Init_CallInstance));
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringIgnPreExp);
  cmock_call_instance->IgnoreArg_GPIOx = 1;
}

