chrydelezuch/3DPrinter/Tests/build/test/mocks/test_stepper_motor/mock_stm32f4xx_hal_gpio.c
void HAL_GPIO_Init_CMockIgnoreArg_GPIO_Init(UNITY_LINE_TYPE cmock_line)
{
  CMOCK_HAL_GPIO_Init_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_Init_CALL_INSTANCE*)CMock_Guts_GetAddressFor(CMock_Guts_MemEndOfChain(Mock.HAL_GPIO_Init_CallInstance));
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringIgnPreExp);
  cmock_call_instance->IgnoreArg_GPIO_Init = 1;
}

#if defined (__IAR_SYSTEMS_ICC__)
#pragma weak HAL_GPIO_DeInit
#else
void HAL_GPIO_DeInit(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin) __weak;
#endif

void HAL_GPIO_DeInit(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin)
{
  UNITY_LINE_TYPE cmock_line = TEST_LINE_NUM;
  CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE* cmock_call_instance;
  UNITY_SET_DETAIL(CMockString_HAL_GPIO_DeInit);
  cmock_call_instance = (CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE*)CMock_Guts_GetAddressFor(Mock.HAL_GPIO_DeInit_CallInstance);
  Mock.HAL_GPIO_DeInit_CallInstance = CMock_Guts_MemNext(Mock.HAL_GPIO_DeInit_CallInstance);
  if (Mock.HAL_GPIO_DeInit_IgnoreBool)
  {
    UNITY_CLR_DETAILS();
    return;
  }
  if (!Mock.HAL_GPIO_DeInit_CallbackBool &&
      Mock.HAL_GPIO_DeInit_CallbackFunctionPointer != NULL)
  {
    Mock.HAL_GPIO_DeInit_CallbackFunctionPointer(GPIOx, GPIO_Pin, Mock.HAL_GPIO_DeInit_CallbackCalls++);
    UNITY_CLR_DETAILS();
    return;
  }
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringCalledMore);
  cmock_line = cmock_call_instance->LineNumber;
  if (cmock_call_instance->CallOrder > ++GlobalVerifyOrder)
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledEarly);
  if (cmock_call_instance->CallOrder < GlobalVerifyOrder)
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledLate);
  if (!cmock_call_instance->ExpectAnyArgsBool)
  {
  if (!cmock_call_instance->IgnoreArg_GPIOx)
  {
    UNITY_SET_DETAILS(CMockString_HAL_GPIO_DeInit,CMockString_GPIOx);
    UNITY_TEST_ASSERT_EQUAL_MEMORY((void*)(cmock_call_instance->Expected_GPIOx), (void*)(GPIOx), sizeof(GPIO_TypeDef), cmock_line, CMockStringMismatch);
  }
  if (!cmock_call_instance->IgnoreArg_GPIO_Pin)
  {
    UNITY_SET_DETAILS(CMockString_HAL_GPIO_DeInit,CMockString_GPIO_Pin);
    UNITY_TEST_ASSERT_EQUAL_UINT32(cmock_call_instance->Expected_GPIO_Pin, GPIO_Pin, cmock_line, CMockStringMismatch);
  }
  }
  if (Mock.HAL_GPIO_DeInit_CallbackFunctionPointer != NULL)
  {
    Mock.HAL_GPIO_DeInit_CallbackFunctionPointer(GPIOx, GPIO_Pin, Mock.HAL_GPIO_DeInit_CallbackCalls++);
  }
  if (cmock_call_instance->ExceptionToThrow != CEXCEPTION_NONE)
  {
    UNITY_CLR_DETAILS();
    Throw(cmock_call_instance->ExceptionToThrow);
  }
  if (cmock_call_instance->ReturnThruPtr_GPIOx_Used)
  {
    UNITY_TEST_ASSERT_NOT_NULL(GPIOx, cmock_line, CMockStringPtrIsNULL);
    memcpy((void*)GPIOx, (const void*)cmock_call_instance->ReturnThruPtr_GPIOx_Val,
      cmock_call_instance->ReturnThruPtr_GPIOx_Size);
  }
  UNITY_CLR_DETAILS();
}

void CMockExpectParameters_HAL_GPIO_DeInit(CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE* cmock_call_instance, GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin);
void CMockExpectParameters_HAL_GPIO_DeInit(CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE* cmock_call_instance, GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin)
{
  cmock_call_instance->Expected_GPIOx = GPIOx;
  cmock_call_instance->IgnoreArg_GPIOx = 0;
  cmock_call_instance->ReturnThruPtr_GPIOx_Used = 0;
  cmock_call_instance->Expected_GPIO_Pin = GPIO_Pin;
  cmock_call_instance->IgnoreArg_GPIO_Pin = 0;
}

void HAL_GPIO_DeInit_CMockIgnore(void)
{
  Mock.HAL_GPIO_DeInit_IgnoreBool = (char)1;
}

void HAL_GPIO_DeInit_CMockStopIgnore(void)
{
  Mock.HAL_GPIO_DeInit_IgnoreBool = (char)0;
}

void HAL_GPIO_DeInit_CMockExpectAnyArgs(UNITY_LINE_TYPE cmock_line)
{
  CMOCK_MEM_INDEX_TYPE cmock_guts_index = CMock_Guts_MemNew(sizeof(CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE));
  CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE*)CMock_Guts_GetAddressFor(cmock_guts_index);
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringOutOfMemory);
  memset(cmock_call_instance, 0, sizeof(*cmock_call_instance));
  Mock.HAL_GPIO_DeInit_CallInstance = CMock_Guts_MemChain(Mock.HAL_GPIO_DeInit_CallInstance, cmock_guts_index);
  Mock.HAL_GPIO_DeInit_IgnoreBool = (char)0;
  cmock_call_instance->LineNumber = cmock_line;
  cmock_call_instance->CallOrder = ++GlobalExpectCount;
  cmock_call_instance->ExceptionToThrow = CEXCEPTION_NONE;
  cmock_call_instance->ExpectAnyArgsBool = (char)0;
  cmock_call_instance->ExpectAnyArgsBool = (char)1;
}

void HAL_GPIO_DeInit_CMockExpect(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin)
{
  CMOCK_MEM_INDEX_TYPE cmock_guts_index = CMock_Guts_MemNew(sizeof(CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE));
  CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE*)CMock_Guts_GetAddressFor(cmock_guts_index);
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringOutOfMemory);
  memset(cmock_call_instance, 0, sizeof(*cmock_call_instance));
  Mock.HAL_GPIO_DeInit_CallInstance = CMock_Guts_MemChain(Mock.HAL_GPIO_DeInit_CallInstance, cmock_guts_index);
  Mock.HAL_GPIO_DeInit_IgnoreBool = (char)0;
  cmock_call_instance->LineNumber = cmock_line;
  cmock_call_instance->CallOrder = ++GlobalExpectCount;
  cmock_call_instance->ExceptionToThrow = CEXCEPTION_NONE;
  cmock_call_instance->ExpectAnyArgsBool = (char)0;
  CMockExpectParameters_HAL_GPIO_DeInit(cmock_call_instance, GPIOx, GPIO_Pin);
}

void HAL_GPIO_DeInit_AddCallback(CMOCK_HAL_GPIO_DeInit_CALLBACK Callback)
{
  Mock.HAL_GPIO_DeInit_IgnoreBool = (char)0;
  Mock.HAL_GPIO_DeInit_CallbackBool = (char)1;
  Mock.HAL_GPIO_DeInit_CallbackFunctionPointer = Callback;
}

void HAL_GPIO_DeInit_Stub(CMOCK_HAL_GPIO_DeInit_CALLBACK Callback)
{
  Mock.HAL_GPIO_DeInit_IgnoreBool = (char)0;
  Mock.HAL_GPIO_DeInit_CallbackBool = (char)0;
  Mock.HAL_GPIO_DeInit_CallbackFunctionPointer = Callback;
}

void HAL_GPIO_DeInit_CMockExpectAndThrow(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin, CEXCEPTION_T cmock_to_throw)
{
  CMOCK_MEM_INDEX_TYPE cmock_guts_index = CMock_Guts_MemNew(sizeof(CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE));
  CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE*)CMock_Guts_GetAddressFor(cmock_guts_index);
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringOutOfMemory);
  memset(cmock_call_instance, 0, sizeof(*cmock_call_instance));
  Mock.HAL_GPIO_DeInit_CallInstance = CMock_Guts_MemChain(Mock.HAL_GPIO_DeInit_CallInstance, cmock_guts_index);
  Mock.HAL_GPIO_DeInit_IgnoreBool = (char)0;
  cmock_call_instance->LineNumber = cmock_line;
  cmock_call_instance->CallOrder = ++GlobalExpectCount;
  cmock_call_instance->ExceptionToThrow = CEXCEPTION_NONE;
  cmock_call_instance->ExpectAnyArgsBool = (char)0;
  CMockExpectParameters_HAL_GPIO_DeInit(cmock_call_instance, GPIOx, GPIO_Pin);
  cmock_call_instance->ExceptionToThrow = cmock_to_throw;
}

void HAL_GPIO_DeInit_CMockReturnMemThruPtr_GPIOx(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef const* GPIOx, size_t cmock_size)
{
  CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE*)CMock_Guts_GetAddressFor(CMock_Guts_MemEndOfChain(Mock.HAL_GPIO_DeInit_CallInstance));
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringPtrPreExp);
  cmock_call_instance->ReturnThruPtr_GPIOx_Used = 1;
  cmock_call_instance->ReturnThruPtr_GPIOx_Val = GPIOx;
  cmock_call_instance->ReturnThruPtr_GPIOx_Size = cmock_size;
}

