chrydelezuch/3DPrinter/Tests/build/test/mocks/test_stepper_motor/mock_stm32f4xx_hal_gpio.c
void HAL_GPIO_DeInit_CMockIgnoreArg_GPIOx(UNITY_LINE_TYPE cmock_line)
{
  CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE*)CMock_Guts_GetAddressFor(CMock_Guts_MemEndOfChain(Mock.HAL_GPIO_DeInit_CallInstance));
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringIgnPreExp);
  cmock_call_instance->IgnoreArg_GPIOx = 1;
}

void HAL_GPIO_DeInit_CMockIgnoreArg_GPIO_Pin(UNITY_LINE_TYPE cmock_line)
{
  CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_DeInit_CALL_INSTANCE*)CMock_Guts_GetAddressFor(CMock_Guts_MemEndOfChain(Mock.HAL_GPIO_DeInit_CallInstance));
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringIgnPreExp);
  cmock_call_instance->IgnoreArg_GPIO_Pin = 1;
}

#if defined (__IAR_SYSTEMS_ICC__)
#pragma weak HAL_GPIO_ReadPin
#else
GPIO_PinState HAL_GPIO_ReadPin(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin) __weak;
#endif

GPIO_PinState HAL_GPIO_ReadPin(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
{
  UNITY_LINE_TYPE cmock_line = TEST_LINE_NUM;
  CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE* cmock_call_instance;
  UNITY_SET_DETAIL(CMockString_HAL_GPIO_ReadPin);
  cmock_call_instance = (CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE*)CMock_Guts_GetAddressFor(Mock.HAL_GPIO_ReadPin_CallInstance);
  Mock.HAL_GPIO_ReadPin_CallInstance = CMock_Guts_MemNext(Mock.HAL_GPIO_ReadPin_CallInstance);
  if (Mock.HAL_GPIO_ReadPin_IgnoreBool)
  {
    UNITY_CLR_DETAILS();
    if (cmock_call_instance == NULL)
      return Mock.HAL_GPIO_ReadPin_FinalReturn;
    memcpy((void*)(&Mock.HAL_GPIO_ReadPin_FinalReturn), (void*)(&cmock_call_instance->ReturnVal),
         sizeof(GPIO_PinState[sizeof(cmock_call_instance->ReturnVal) == sizeof(GPIO_PinState) ? 1 : -1])); /* add GPIO_PinState to :treat_as_array if this causes an error */
    return cmock_call_instance->ReturnVal;
  }
  if (!Mock.HAL_GPIO_ReadPin_CallbackBool &&
      Mock.HAL_GPIO_ReadPin_CallbackFunctionPointer != NULL)
  {
    GPIO_PinState cmock_cb_ret = Mock.HAL_GPIO_ReadPin_CallbackFunctionPointer(GPIOx, GPIO_Pin, Mock.HAL_GPIO_ReadPin_CallbackCalls++);
    UNITY_CLR_DETAILS();
    return cmock_cb_ret;
  }
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringCalledMore);
  cmock_line = cmock_call_instance->LineNumber;
  if (cmock_call_instance->CallOrder > ++GlobalVerifyOrder)
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledEarly);
  if (cmock_call_instance->CallOrder < GlobalVerifyOrder)
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledLate);
  if (!cmock_call_instance->ExpectAnyArgsBool)
  {
  if (!cmock_call_instance->IgnoreArg_GPIOx)
  {
    UNITY_SET_DETAILS(CMockString_HAL_GPIO_ReadPin,CMockString_GPIOx);
    UNITY_TEST_ASSERT_EQUAL_MEMORY((void*)(cmock_call_instance->Expected_GPIOx), (void*)(GPIOx), sizeof(GPIO_TypeDef), cmock_line, CMockStringMismatch);
  }
  if (!cmock_call_instance->IgnoreArg_GPIO_Pin)
  {
    UNITY_SET_DETAILS(CMockString_HAL_GPIO_ReadPin,CMockString_GPIO_Pin);
    UNITY_TEST_ASSERT_EQUAL_HEX16(cmock_call_instance->Expected_GPIO_Pin, GPIO_Pin, cmock_line, CMockStringMismatch);
  }
  }
  if (Mock.HAL_GPIO_ReadPin_CallbackFunctionPointer != NULL)
  {
    cmock_call_instance->ReturnVal = Mock.HAL_GPIO_ReadPin_CallbackFunctionPointer(GPIOx, GPIO_Pin, Mock.HAL_GPIO_ReadPin_CallbackCalls++);
  }
  if (cmock_call_instance->ExceptionToThrow != CEXCEPTION_NONE)
  {
    UNITY_CLR_DETAILS();
    Throw(cmock_call_instance->ExceptionToThrow);
  }
  if (cmock_call_instance->ReturnThruPtr_GPIOx_Used)
  {
    UNITY_TEST_ASSERT_NOT_NULL(GPIOx, cmock_line, CMockStringPtrIsNULL);
    memcpy((void*)GPIOx, (const void*)cmock_call_instance->ReturnThruPtr_GPIOx_Val,
      cmock_call_instance->ReturnThruPtr_GPIOx_Size);
  }
  UNITY_CLR_DETAILS();
  return cmock_call_instance->ReturnVal;
}

void CMockExpectParameters_HAL_GPIO_ReadPin(CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE* cmock_call_instance, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);
void CMockExpectParameters_HAL_GPIO_ReadPin(CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE* cmock_call_instance, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin)
{
  cmock_call_instance->Expected_GPIOx = GPIOx;
  cmock_call_instance->IgnoreArg_GPIOx = 0;
  cmock_call_instance->ReturnThruPtr_GPIOx_Used = 0;
  cmock_call_instance->Expected_GPIO_Pin = GPIO_Pin;
  cmock_call_instance->IgnoreArg_GPIO_Pin = 0;
}

void HAL_GPIO_ReadPin_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, GPIO_PinState cmock_to_return)
{
  CMOCK_MEM_INDEX_TYPE cmock_guts_index = CMock_Guts_MemNew(sizeof(CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE));
  CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE*)CMock_Guts_GetAddressFor(cmock_guts_index);
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringOutOfMemory);
  memset(cmock_call_instance, 0, sizeof(*cmock_call_instance));
  Mock.HAL_GPIO_ReadPin_CallInstance = CMock_Guts_MemChain(Mock.HAL_GPIO_ReadPin_CallInstance, cmock_guts_index);
  Mock.HAL_GPIO_ReadPin_IgnoreBool = (char)0;
  cmock_call_instance->LineNumber = cmock_line;
  cmock_call_instance->ExceptionToThrow = CEXCEPTION_NONE;
  cmock_call_instance->ExpectAnyArgsBool = (char)0;
  cmock_call_instance->ReturnVal = cmock_to_return;
  Mock.HAL_GPIO_ReadPin_IgnoreBool = (char)1;
}

void HAL_GPIO_ReadPin_CMockStopIgnore(void)
{
  if(Mock.HAL_GPIO_ReadPin_IgnoreBool)
    Mock.HAL_GPIO_ReadPin_CallInstance = CMock_Guts_MemNext(Mock.HAL_GPIO_ReadPin_CallInstance);
  Mock.HAL_GPIO_ReadPin_IgnoreBool = (char)0;
}

void HAL_GPIO_ReadPin_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, GPIO_PinState cmock_to_return)
{
  CMOCK_MEM_INDEX_TYPE cmock_guts_index = CMock_Guts_MemNew(sizeof(CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE));
  CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE*)CMock_Guts_GetAddressFor(cmock_guts_index);
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringOutOfMemory);
  memset(cmock_call_instance, 0, sizeof(*cmock_call_instance));
  Mock.HAL_GPIO_ReadPin_CallInstance = CMock_Guts_MemChain(Mock.HAL_GPIO_ReadPin_CallInstance, cmock_guts_index);
  Mock.HAL_GPIO_ReadPin_IgnoreBool = (char)0;
  cmock_call_instance->LineNumber = cmock_line;
  cmock_call_instance->CallOrder = ++GlobalExpectCount;
  cmock_call_instance->ExceptionToThrow = CEXCEPTION_NONE;
  cmock_call_instance->ExpectAnyArgsBool = (char)0;
  cmock_call_instance->ReturnVal = cmock_to_return;
  cmock_call_instance->ExpectAnyArgsBool = (char)1;
}

void HAL_GPIO_ReadPin_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, GPIO_PinState cmock_to_return)
{
  CMOCK_MEM_INDEX_TYPE cmock_guts_index = CMock_Guts_MemNew(sizeof(CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE));
  CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_ReadPin_CALL_INSTANCE*)CMock_Guts_GetAddressFor(cmock_guts_index);
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringOutOfMemory);
  memset(cmock_call_instance, 0, sizeof(*cmock_call_instance));
  Mock.HAL_GPIO_ReadPin_CallInstance = CMock_Guts_MemChain(Mock.HAL_GPIO_ReadPin_CallInstance, cmock_guts_index);
  Mock.HAL_GPIO_ReadPin_IgnoreBool = (char)0;
  cmock_call_instance->LineNumber = cmock_line;
  cmock_call_instance->CallOrder = ++GlobalExpectCount;
  cmock_call_instance->ExceptionToThrow = CEXCEPTION_NONE;
  cmock_call_instance->ExpectAnyArgsBool = (char)0;
  CMockExpectParameters_HAL_GPIO_ReadPin(cmock_call_instance, GPIOx, GPIO_Pin);
  memcpy((void*)(&cmock_call_instance->ReturnVal), (void*)(&cmock_to_return),
         sizeof(GPIO_PinState[sizeof(cmock_to_return) == sizeof(GPIO_PinState) ? 1 : -1])); /* add GPIO_PinState to :treat_as_array if this causes an error */
}

void HAL_GPIO_ReadPin_AddCallback(CMOCK_HAL_GPIO_ReadPin_CALLBACK Callback)
{
  Mock.HAL_GPIO_ReadPin_IgnoreBool = (char)0;
  Mock.HAL_GPIO_ReadPin_CallbackBool = (char)1;
  Mock.HAL_GPIO_ReadPin_CallbackFunctionPointer = Callback;
}

