chrydelezuch/3DPrinter/Tests/build/test/mocks/test_stepper_motor/mock_stm32f4xx_hal_gpio.c
void HAL_GPIO_LockPin_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, HAL_StatusTypeDef cmock_to_return)
{
  CMOCK_MEM_INDEX_TYPE cmock_guts_index = CMock_Guts_MemNew(sizeof(CMOCK_HAL_GPIO_LockPin_CALL_INSTANCE));
  CMOCK_HAL_GPIO_LockPin_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_LockPin_CALL_INSTANCE*)CMock_Guts_GetAddressFor(cmock_guts_index);
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringOutOfMemory);
  memset(cmock_call_instance, 0, sizeof(*cmock_call_instance));
  Mock.HAL_GPIO_LockPin_CallInstance = CMock_Guts_MemChain(Mock.HAL_GPIO_LockPin_CallInstance, cmock_guts_index);
  Mock.HAL_GPIO_LockPin_IgnoreBool = (char)0;
  cmock_call_instance->LineNumber = cmock_line;
  cmock_call_instance->CallOrder = ++GlobalExpectCount;
  cmock_call_instance->ExceptionToThrow = CEXCEPTION_NONE;
  cmock_call_instance->ExpectAnyArgsBool = (char)0;
  CMockExpectParameters_HAL_GPIO_LockPin(cmock_call_instance, GPIOx, GPIO_Pin);
  cmock_call_instance->ReturnVal = cmock_to_return;
}

void HAL_GPIO_LockPin_AddCallback(CMOCK_HAL_GPIO_LockPin_CALLBACK Callback)
{
  Mock.HAL_GPIO_LockPin_IgnoreBool = (char)0;
  Mock.HAL_GPIO_LockPin_CallbackBool = (char)1;
  Mock.HAL_GPIO_LockPin_CallbackFunctionPointer = Callback;
}

void HAL_GPIO_LockPin_Stub(CMOCK_HAL_GPIO_LockPin_CALLBACK Callback)
{
  Mock.HAL_GPIO_LockPin_IgnoreBool = (char)0;
  Mock.HAL_GPIO_LockPin_CallbackBool = (char)0;
  Mock.HAL_GPIO_LockPin_CallbackFunctionPointer = Callback;
}

void HAL_GPIO_LockPin_CMockExpectAndThrow(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, CEXCEPTION_T cmock_to_throw)
{
  CMOCK_MEM_INDEX_TYPE cmock_guts_index = CMock_Guts_MemNew(sizeof(CMOCK_HAL_GPIO_LockPin_CALL_INSTANCE));
  CMOCK_HAL_GPIO_LockPin_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_LockPin_CALL_INSTANCE*)CMock_Guts_GetAddressFor(cmock_guts_index);
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringOutOfMemory);
  memset(cmock_call_instance, 0, sizeof(*cmock_call_instance));
  Mock.HAL_GPIO_LockPin_CallInstance = CMock_Guts_MemChain(Mock.HAL_GPIO_LockPin_CallInstance, cmock_guts_index);
  Mock.HAL_GPIO_LockPin_IgnoreBool = (char)0;
  cmock_call_instance->LineNumber = cmock_line;
  cmock_call_instance->CallOrder = ++GlobalExpectCount;
  cmock_call_instance->ExceptionToThrow = CEXCEPTION_NONE;
  cmock_call_instance->ExpectAnyArgsBool = (char)0;
  CMockExpectParameters_HAL_GPIO_LockPin(cmock_call_instance, GPIOx, GPIO_Pin);
  cmock_call_instance->ExceptionToThrow = cmock_to_throw;
}

void HAL_GPIO_LockPin_CMockReturnMemThruPtr_GPIOx(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef const* GPIOx, size_t cmock_size)
{
  CMOCK_HAL_GPIO_LockPin_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_LockPin_CALL_INSTANCE*)CMock_Guts_GetAddressFor(CMock_Guts_MemEndOfChain(Mock.HAL_GPIO_LockPin_CallInstance));
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringPtrPreExp);
  cmock_call_instance->ReturnThruPtr_GPIOx_Used = 1;
  cmock_call_instance->ReturnThruPtr_GPIOx_Val = GPIOx;
  cmock_call_instance->ReturnThruPtr_GPIOx_Size = cmock_size;
}

void HAL_GPIO_LockPin_CMockIgnoreArg_GPIOx(UNITY_LINE_TYPE cmock_line)
{
  CMOCK_HAL_GPIO_LockPin_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_LockPin_CALL_INSTANCE*)CMock_Guts_GetAddressFor(CMock_Guts_MemEndOfChain(Mock.HAL_GPIO_LockPin_CallInstance));
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringIgnPreExp);
  cmock_call_instance->IgnoreArg_GPIOx = 1;
}

void HAL_GPIO_LockPin_CMockIgnoreArg_GPIO_Pin(UNITY_LINE_TYPE cmock_line)
{
  CMOCK_HAL_GPIO_LockPin_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_LockPin_CALL_INSTANCE*)CMock_Guts_GetAddressFor(CMock_Guts_MemEndOfChain(Mock.HAL_GPIO_LockPin_CallInstance));
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringIgnPreExp);
  cmock_call_instance->IgnoreArg_GPIO_Pin = 1;
}

#if defined (__IAR_SYSTEMS_ICC__)
#pragma weak HAL_GPIO_EXTI_IRQHandler
#else
void HAL_GPIO_EXTI_IRQHandler(uint16_t GPIO_Pin) __weak;
#endif

void HAL_GPIO_EXTI_IRQHandler(uint16_t GPIO_Pin)
{
  UNITY_LINE_TYPE cmock_line = TEST_LINE_NUM;
  CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE* cmock_call_instance;
  UNITY_SET_DETAIL(CMockString_HAL_GPIO_EXTI_IRQHandler);
  cmock_call_instance = (CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE*)CMock_Guts_GetAddressFor(Mock.HAL_GPIO_EXTI_IRQHandler_CallInstance);
  Mock.HAL_GPIO_EXTI_IRQHandler_CallInstance = CMock_Guts_MemNext(Mock.HAL_GPIO_EXTI_IRQHandler_CallInstance);
  if (Mock.HAL_GPIO_EXTI_IRQHandler_IgnoreBool)
  {
    UNITY_CLR_DETAILS();
    return;
  }
  if (!Mock.HAL_GPIO_EXTI_IRQHandler_CallbackBool &&
      Mock.HAL_GPIO_EXTI_IRQHandler_CallbackFunctionPointer != NULL)
  {
    Mock.HAL_GPIO_EXTI_IRQHandler_CallbackFunctionPointer(GPIO_Pin, Mock.HAL_GPIO_EXTI_IRQHandler_CallbackCalls++);
    UNITY_CLR_DETAILS();
    return;
  }
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringCalledMore);
  cmock_line = cmock_call_instance->LineNumber;
  if (cmock_call_instance->CallOrder > ++GlobalVerifyOrder)
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledEarly);
  if (cmock_call_instance->CallOrder < GlobalVerifyOrder)
    UNITY_TEST_FAIL(cmock_line, CMockStringCalledLate);
  if (!cmock_call_instance->ExpectAnyArgsBool)
  {
  if (!cmock_call_instance->IgnoreArg_GPIO_Pin)
  {
    UNITY_SET_DETAILS(CMockString_HAL_GPIO_EXTI_IRQHandler,CMockString_GPIO_Pin);
    UNITY_TEST_ASSERT_EQUAL_HEX16(cmock_call_instance->Expected_GPIO_Pin, GPIO_Pin, cmock_line, CMockStringMismatch);
  }
  }
  if (Mock.HAL_GPIO_EXTI_IRQHandler_CallbackFunctionPointer != NULL)
  {
    Mock.HAL_GPIO_EXTI_IRQHandler_CallbackFunctionPointer(GPIO_Pin, Mock.HAL_GPIO_EXTI_IRQHandler_CallbackCalls++);
  }
  if (cmock_call_instance->ExceptionToThrow != CEXCEPTION_NONE)
  {
    UNITY_CLR_DETAILS();
    Throw(cmock_call_instance->ExceptionToThrow);
  }
  UNITY_CLR_DETAILS();
}

void CMockExpectParameters_HAL_GPIO_EXTI_IRQHandler(CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE* cmock_call_instance, uint16_t GPIO_Pin);
void CMockExpectParameters_HAL_GPIO_EXTI_IRQHandler(CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE* cmock_call_instance, uint16_t GPIO_Pin)
{
  cmock_call_instance->Expected_GPIO_Pin = GPIO_Pin;
  cmock_call_instance->IgnoreArg_GPIO_Pin = 0;
}

void HAL_GPIO_EXTI_IRQHandler_CMockIgnore(void)
{
  Mock.HAL_GPIO_EXTI_IRQHandler_IgnoreBool = (char)1;
}

void HAL_GPIO_EXTI_IRQHandler_CMockStopIgnore(void)
{
  Mock.HAL_GPIO_EXTI_IRQHandler_IgnoreBool = (char)0;
}

