chrydelezuch/3DPrinter/Tests/build/test/mocks/test_stepper_motor/mock_stm32f4xx_hal_gpio.c
void HAL_GPIO_EXTI_IRQHandler_CMockExpectAnyArgs(UNITY_LINE_TYPE cmock_line)
{
  CMOCK_MEM_INDEX_TYPE cmock_guts_index = CMock_Guts_MemNew(sizeof(CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE));
  CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE*)CMock_Guts_GetAddressFor(cmock_guts_index);
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringOutOfMemory);
  memset(cmock_call_instance, 0, sizeof(*cmock_call_instance));
  Mock.HAL_GPIO_EXTI_IRQHandler_CallInstance = CMock_Guts_MemChain(Mock.HAL_GPIO_EXTI_IRQHandler_CallInstance, cmock_guts_index);
  Mock.HAL_GPIO_EXTI_IRQHandler_IgnoreBool = (char)0;
  cmock_call_instance->LineNumber = cmock_line;
  cmock_call_instance->CallOrder = ++GlobalExpectCount;
  cmock_call_instance->ExceptionToThrow = CEXCEPTION_NONE;
  cmock_call_instance->ExpectAnyArgsBool = (char)0;
  cmock_call_instance->ExpectAnyArgsBool = (char)1;
}

void HAL_GPIO_EXTI_IRQHandler_CMockExpect(UNITY_LINE_TYPE cmock_line, uint16_t GPIO_Pin)
{
  CMOCK_MEM_INDEX_TYPE cmock_guts_index = CMock_Guts_MemNew(sizeof(CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE));
  CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE*)CMock_Guts_GetAddressFor(cmock_guts_index);
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringOutOfMemory);
  memset(cmock_call_instance, 0, sizeof(*cmock_call_instance));
  Mock.HAL_GPIO_EXTI_IRQHandler_CallInstance = CMock_Guts_MemChain(Mock.HAL_GPIO_EXTI_IRQHandler_CallInstance, cmock_guts_index);
  Mock.HAL_GPIO_EXTI_IRQHandler_IgnoreBool = (char)0;
  cmock_call_instance->LineNumber = cmock_line;
  cmock_call_instance->CallOrder = ++GlobalExpectCount;
  cmock_call_instance->ExceptionToThrow = CEXCEPTION_NONE;
  cmock_call_instance->ExpectAnyArgsBool = (char)0;
  CMockExpectParameters_HAL_GPIO_EXTI_IRQHandler(cmock_call_instance, GPIO_Pin);
}

void HAL_GPIO_EXTI_IRQHandler_AddCallback(CMOCK_HAL_GPIO_EXTI_IRQHandler_CALLBACK Callback)
{
  Mock.HAL_GPIO_EXTI_IRQHandler_IgnoreBool = (char)0;
  Mock.HAL_GPIO_EXTI_IRQHandler_CallbackBool = (char)1;
  Mock.HAL_GPIO_EXTI_IRQHandler_CallbackFunctionPointer = Callback;
}

void HAL_GPIO_EXTI_IRQHandler_Stub(CMOCK_HAL_GPIO_EXTI_IRQHandler_CALLBACK Callback)
{
  Mock.HAL_GPIO_EXTI_IRQHandler_IgnoreBool = (char)0;
  Mock.HAL_GPIO_EXTI_IRQHandler_CallbackBool = (char)0;
  Mock.HAL_GPIO_EXTI_IRQHandler_CallbackFunctionPointer = Callback;
}

void HAL_GPIO_EXTI_IRQHandler_CMockExpectAndThrow(UNITY_LINE_TYPE cmock_line, uint16_t GPIO_Pin, CEXCEPTION_T cmock_to_throw)
{
  CMOCK_MEM_INDEX_TYPE cmock_guts_index = CMock_Guts_MemNew(sizeof(CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE));
  CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE*)CMock_Guts_GetAddressFor(cmock_guts_index);
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringOutOfMemory);
  memset(cmock_call_instance, 0, sizeof(*cmock_call_instance));
  Mock.HAL_GPIO_EXTI_IRQHandler_CallInstance = CMock_Guts_MemChain(Mock.HAL_GPIO_EXTI_IRQHandler_CallInstance, cmock_guts_index);
  Mock.HAL_GPIO_EXTI_IRQHandler_IgnoreBool = (char)0;
  cmock_call_instance->LineNumber = cmock_line;
  cmock_call_instance->CallOrder = ++GlobalExpectCount;
  cmock_call_instance->ExceptionToThrow = CEXCEPTION_NONE;
  cmock_call_instance->ExpectAnyArgsBool = (char)0;
  CMockExpectParameters_HAL_GPIO_EXTI_IRQHandler(cmock_call_instance, GPIO_Pin);
  cmock_call_instance->ExceptionToThrow = cmock_to_throw;
}

void HAL_GPIO_EXTI_IRQHandler_CMockIgnoreArg_GPIO_Pin(UNITY_LINE_TYPE cmock_line)
{
  CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE* cmock_call_instance = (CMOCK_HAL_GPIO_EXTI_IRQHandler_CALL_INSTANCE*)CMock_Guts_GetAddressFor(CMock_Guts_MemEndOfChain(Mock.HAL_GPIO_EXTI_IRQHandler_CallInstance));
  UNITY_TEST_ASSERT_NOT_NULL(cmock_call_instance, cmock_line, CMockStringIgnPreExp);
  cmock_call_instance->IgnoreArg_GPIO_Pin = 1;
}

